{
     "head":  {
        "title": "Edwin Lopez | Sobre",
        "description": "Edwin Lopez se graduó de la Universidad de California, Irvine como ingeniero de software y disfruta trabajar en proyectos web front-end y back-end.",
        "keywords": "ingeniero de software, universidad de california irvine, front-end, back-end"
    },
    "about": "Quien soy",
    "ImAFirstGen": "Soy un estudiante universitario de primera generación que se graduó de la Universidad de California, Irvine como ingeniero de software. Disfruto trabajando en varios proyectos, desde desarrollo de juegos hasta desarrollo web. Actualmente, estoy buscando oportunidades para trabajar en proyectos de desarrollo de software emocionantes y desafiantes, donde pueda usar mi experiencia técnica para crear soluciones innovadoras. Ya sea desarrollo web front-end/back-end o desarrollo de aplicaciones móviles, estoy ansioso por asumir nuevos desafíos y contribuir al campo de la ingeniería de software.",
    "myPassion": "Mi propósito y pasión",
    "uncoveredMyPassion": "Mi pasión por la programación se despertó inicialmente cuando tomé una clase de informática de un semestre de duración en la escuela secundaria. Aunque se trataba de mover bloques de código a programar, cuando terminé una réplica funcional del juego de Mario, despertó mi curiosidad y rápidamente descubrí que la programación ofrecía mucho más. Me enamoré del aspecto de resolución de problemas de la programación, la satisfacción que surge al crear algo desde cero y el aprendizaje constante que se requiere para mantenerse al día con los avances tecnológicos.",
    "moreAboutMyPassion": "Para mí, el proceso de creación de un programa es tan gratificante como el producto final. Disfruto el desafío de encontrar soluciones a los problemas y las nuevas habilidades que aprendo en el camino. Ya sea para depurar un error obstinado o descubrir cómo integrar una nueva función en un programa existente, encuentro que todo el proceso es intelectualmente estimulante y satisfactorio. En general, mi pasión por la programación no ha hecho más que crecer y estoy emocionado de seguir explorando nuevos lenguajes de programación, tecnologías e ideas de proyectos en el futuro.",
    "images": {
        "wave": "Memoji de mí mismo sonriendo y saludando.",
        "coding": "Manos escribiendo en un teclado con una planta, café, mouse y monitor en el espacio de trabajo."
    }
}