{
  "head": {
    "title": "Edwin López | Proyectos",
    "description": "Una muestra de los diversos proyectos web/móviles y programas informáticos de Edwin.",
    "keywords": "proyectos, desarrollo móvil, desarrollo web, frameworks, ingeniero de software, front-end, back-end"
  },
  "projects": "Mi Viaje en la Programación",
  "checkOutProjects": "Entra en mi mundo creativo y explora mi diversa gama de proyectos, elaborados con varios lenguajes de programación y frameworks.",
  "behindLaptopImgAlt": "Memoji de mí mismo detrás de una computadora portátil.",
  "dreamScholars": {
    "overview": "Una aplicación web que facilita la visibilidad de becas para estudiantes.",
    "description": "DreamScholars es una aplicación web diseñada para facilitar la exploración, búsqueda, intercambio, filtrado y adición de becas. Los usuarios pueden descubrir fácilmente becas en función de diferentes atributos, como especialización académica, monto del premio, grado, escuela y estado. El equipo y yo estamos dedicados a mejorar continuamente la experiencia del usuario mediante la adición de nuevas funciones interesantes en un futuro próximo.",
    "moreDetails": "Mi responsabilidad principal es desarrollar e implementar la interfaz de usuario de la aplicación web, lo que incluye el diseño y la incorporación de diversas funcionalidades, como la validación de datos, el filtrado de becas y la traducción de idiomas. Además, he contribuido a la funcionalidad de back-end del sitio, lo que permite una interacción fluida entre los componentes y la base de datos, incluidas funciones como guardar y buscar becas e implementar reglas de seguridad de la base de datos. Para garantizar la calidad y la funcionalidad de los componentes, realizo pruebas unitarias utilizando Jest y React Testing Library. Además de programar, también participo activamente en la realización de revisiones de código para los miembros de mi equipo.",
    "mainAltText": "Una tableta y un iPhone que muestran la página de inicio del sitio web de becas.",
    "secondaryAltText": "Varias vistas del sitio web que muestran los filtros, la página de becas y el formulario de becas."
  },
  "nedflix": {
    "overview": "Una aplicación web para explorar, descubrir y listar películas y programas.",
    "description": "Nedflix es una aplicación web integral que permite a los usuarios navegar y buscar fácilmente a través de una amplia colección de películas y programas. Con funciones como navegar y ver avances, los usuarios pueden encontrar rápidamente su próxima película o serie favorita. La plataforma también ofrece categorías populares como \"las más populares\" y \"mejor calificadas\" para ayudar a los usuarios a descubrir contenido nuevo que se alinee con sus intereses. Para realizar un seguimiento de sus favoritos, los usuarios pueden agregar o eliminar cómodamente películas y programas de su lista personalizada.",
    "moreDetails": "Para ofrecer la experiencia más actualizada y atractiva para los usuarios, el sitio obtiene su contenido de la API de The Movie Database. Para mejorar la experiencia del usuario y agilizar la navegación, se agregaron autenticación de usuario, carga diferida y desplazamiento infinito.",
    "mainAltText": "Una tableta y un iPhone que muestran una pancarta de una película seguida de carteles de películas para explorar.",
    "secondaryAltText": "Varias pantallas que muestran la página de mi lista, inicio de sesión, búsqueda y películas."
  },
  "casaMagda": {
    "overview": "Un sitio web que destaca los servicios de una pequeña empresa de limpieza.",
    "description": "Casa Magda es un sitio web de una sola página que sirve como escaparate de los servicios de una pequeña empresa de limpieza. Además de destacar la gama de servicios de la empresa, el sitio también proporciona información valiosa sobre la historia, la misión y los valores de la empresa.",
    "moreDetails": "Construido con una combinación de HTML, CSS, JavaScript y JQuery, el sitio proporciona una experiencia de usuario muy atractiva e intuitiva. Mediante animaciones de CSS, técnicas de SEO y principios de UX, el sitio web pudo aumentar su visibilidad y sus ganancias en un 50%.",
    "mainAltText": "Un iPhone y un Macbook que muestran la página de destino del sitio web.",
    "secondaryAltText": "2 pantallas que muestran la página de inicio, sobre nosotros, nuestros servicios, ubicaciones y secciones del formulario de contacto del sitio web."
  },
  "trapd": {
    "overview": "Un juego de plataformas móvil de acción sin fin disponible en Google Play Store.",
    "description": "TRAPD es un juego de plataformas de acción en el que el objetivo del juego es sobrevivir el mayor tiempo posible mientras esquivas una andanada de obstáculos, cañones y láseres. El juego ofrece un elenco de diversos personajes jugables para elegir, cada uno con su habilidad única. A lo largo del juego, descubrirás una variedad de monedas coleccionables, cada una con un valor diferente de puntos de experiencia (XP) que puedes usar para subir de nivel a tu personaje.",
    "moreDetails": "TRAPD es mi proyecto en solitario más ambicioso y se puede descargar gratis en Google Play Store. El juego cuenta con seguimiento de progreso automático y registro de puntaje alto. También se admiten transacciones en el juego, lo que permite a los jugadores usar las monedas que recolectan para mejorar las habilidades de su personaje y desbloquear nuevos personajes jugables. Como creador del juego, me enorgullece decir que he manejado todos los aspectos de su desarrollo, desde el diseño de la interfaz de usuario hasta la creación de animaciones, secuencias de comandos, recursos y sprites del juego, e incluso la composición de la música.",
    "mainAltText": "Un teléfono móvil que muestra el menú principal del juego TRAPD.",
    "secondaryAltText": "Múltiples teléfonos que muestran la tienda, las criaturas, las puntuaciones más altas, el fin del juego y las pantallas de juego."
  },
  "pacificMarineApp": {
    "overview": "Un juego interactivo destinado a educar a los visitantes del Centro de Mamíferos Marinos del Pacífico.",
    "description": "Un juego interactivo diseñado para mostrar y educar a los usuarios sobre el trabajo de rehabilitación llevado a cabo por el Centro de Mamíferos Marinos del Pacífico. El juego lleva a los usuarios en un viaje a través del proceso de rehabilitación de cuatro leones marinos, ofreciendo una visión integral de los esfuerzos del centro para cuidar a los mamíferos marinos para que recuperen la salud.",
    "moreDetails": "Como parte de mi proyecto final en UCI, colaboré con otros cuatro miembros del equipo para crear este juego innovador con Unity. Mis contribuciones principales incluyeron el diseño y la implementación de guiones, animaciones y diseños de niveles. Al mismo tiempo garantizaba que la interfaz de usuario, los activos del juego y los efectos de sonido estuvieran a la altura. Más allá de la programación, también asumí un papel de liderazgo, supervisando el trabajo de los miembros de mi equipo y asegurándome de que el proyecto iba por buen camino. Al trabajar juntos, pudimos crear una experiencia inmersiva y educativa que muestra el trabajo crucial del Centro de Mamíferos Marinos del Pacífico en la rehabilitación de mamíferos marinos.",
    "mainAltText": "Una tablilla que muestra un león marino con un inventario de herramientas debajo.",
    "secondaryAltText": "Múltiples tablillas que muestran diferentes leones marinos tratados y rehabilitados con las herramientas del inventario."
  },
  "partyBash": {
    "overview": "Una aplicación complementaria para un juego de mesa que creé.",
    "description": "El objetivo de Party Bash es que los jugadores compitan entre sí, desplazándose por un tablero de juego y tratando de llegar a la meta antes que sus oponentes. El tablero de juego está diseñado con una variedad de cuadrados que introducen emocionantes eventos y desafíos en el juego. Cada cuadro contiene un evento único, que puede resultar en ganar o perder monedas, comprar acciones adicionales, recibir premios o incluso robar monedas de otros jugadores.",
    "moreDetails": "La aplicación brinda a los jugadores una experiencia de juego perfecta, al automatizar varios aspectos del juego que, de otro modo, serían tediosos y lentos. Por ejemplo, la aplicación permite a los jugadores lanzar dados virtuales con facilidad. Además, la aplicación simplifica los cálculos relacionados con la gestión de monedas, como el seguimiento de las monedas ganadas o perdidas durante el juego. Los jugadores también pueden usar la aplicación para administrar premios aleatorios, desafíos y compras de beneficios o actualizaciones.",
    "mainAltText": "Un teléfono mostrando el menú del juego, con 2 jugadores listos para jugar.",
    "secondaryAltText": "Numerosos teléfonos que muestran las pantallas de monedas, tienda, rueda, desafío y tirada de dados."
  },
  "searchEd": {
    "overview": "Buscador de las páginas web de las Ciencias de la Información y Computación de UCI.",
    "description": "Search-ED es un motor de búsqueda diseñado específicamente para ayudar a los usuarios a explorar la amplia gama de páginas web asociadas con el departamento de Ciencias de la Información y Computación de la Universidad de California, Irvine. Al ingresar una consulta de búsqueda, Search-ED recupera las páginas web más relevantes y las muestra en un formato organizado y fácilmente navegable.",
    "moreDetails": "Para proporcionar a los usuarios los resultados de búsqueda más relevantes, Search-ED emplea técnicas como tokenización, análisis de frecuencia de términos, ponderación inversa de frecuencia de documentos y etiquetas ponderadas para la calificación de páginas. La biblioteca BeautifulSoup se utilizó para analizar el corpus de todas las páginas web de ICS de la Universidad de California, Irvine. Se eligió Python como lenguaje de programación para el desarrollo del motor de búsqueda, mientras que MongoDB se utilizó como sistema de gestión de la base de datos. Además, la interfaz gráfica de usuario (GUI) de Search-ED se creó utilizando la biblioteca TKinter.",
    "mainAltText": "Una computadora portátil que muestra una pantalla dividida con 2 archivos de código Python abiertos.",
    "secondaryAltText": "2 monitores que muestran el campo de búsqueda seguido de los resultados y una base de datos MongoDB."
  },
  "faultLocalization": {
    "overview": "Un programa que encuentra qué líneas de código tienen más probabilidades de fallar las pruebas unitarias.",
    "description": "Las capacidades de localización de fallas del programa se logran mediante la implementación del enfoque Tarántula, que es una técnica sofisticada para identificar qué líneas de código tienen más probabilidades de ser responsables de romper las pruebas unitarias de un proyecto de código abierto alojado en Github. Con este enfoque, el programa puede aislar de manera efectiva las secciones de código que se sospecha que se están utilizando.",
    "moreDetails": "Este programa contiene un vasto repositorio de más de 4 mil archivos XML que contienen análisis detallados de cobertura de código. El algoritmo utilizado por el programa se basa en un análisis cuidadoso de los casos de prueba que cubren cada línea del programa, comparando la proporción de casos de prueba exitosos y fallidos para determinar el nivel de sospecha de cada línea de código. En esencia, el algoritmo asigna un valor entre 0 y 1 a cada línea de código, donde un valor más alto indica una mayor probabilidad de que la línea sea la responsable de que falle una prueba.",
    "mainAltText": "Una computadora portátil que muestra una pantalla dividida con 2 archivos de código Python abiertos.",
    "secondaryAltText": "Un monitor con una pantalla dividida de un archivo CSV con puntajes y un archivo de código abierto al lado."
  },
  "operatingSystemGui": {
    "overview": "Un sistema operativo simple que simula a los usuarios escribiendo en discos e imprimiendo archivos.",
    "description": "Diseñado para simular un sistema operativo básico, este programa gestiona las solicitudes de lectura, escritura e impresión. Se utiliza una interfaz gráfica de usuario (GUI) para mostrar las solicitudes de los usuarios, así como el estado de los discos e impresoras y el contenido del administrador de directorios.",
    "moreDetails": "El programa admite una cantidad dinámica de usuarios, impresoras y discos y utiliza paralelismo e hilos para ejecutar comandos desde archivos de usuario. Cuando se ejecuta el comando guardar, el programa solicita un recurso de disco y escribe el contenido del archivo en el disco hasta que se encuentra el comando final. El comando final registra el número de disco, el sector inicial y la longitud del archivo, creando una nueva entrada en el administrador de directorios y liberando el recurso del disco. Finalmente, el comando de impresión busca en el administrador de directorios el nombre de archivo especificado, selecciona una impresora libre e imprime los datos en un archivo externo.",
    "mainAltText": "Una computadora portátil que muestra una pantalla dividida con 2 archivos de código Java abiertos.",
    "secondaryAltText": "Un monitor con un archivo python abierto y una GUI al lado que muestra los usuarios, discos, impresoras y el estado del administrador de directorios."
  },
  "infoWeather": {
    "overview": "Un sitio web para buscar y ver información meteorológica desde varios lugares.",
    "description": "Info Weather es un sitio web simple que muestra el clima actual y el pronóstico de cualquier ubicación determinada.",
    "moreDetails": "Info Weather está escrito con React y obtiene la información de la API de OpenWeather y muestra la información de forma minimalista. Además, el sitio determina los íconos apropiados según el clima.",
    "mainAltText": "Un teléfono y una tableta que muestran información meteorológica.",
    "secondaryAltText": "Una pantalla de sitio web de información meteorológica."
  }
}
