{
     "head":  {
        "title": "Edwin López | Proyectos",
        "description": "Una muestra de los diversos proyectos web/móviles y programas informáticos de Edwin.",
        "keywords": "proyectos, desarrollo móvil, desarrollo web, frameworks, ingeniero de software, front-end, back-end"
    },
    "projects": "Mi Viaje en la Programación",
    "checkOutProjects": "Entra en mi mundo creativo y explora mi diversa gama de proyectos, elaborados con varios lenguajes de programación y frameworks.",
    "behindLaptopImgAlt": "Memoji de mí mismo detrás de una computadora portátil.",
    "dreamScholars": {
        "overview": "Una aplicación web que facilita la visibilidad de becas para estudiantes.",
        "description": "DreamScholars es una aplicación web diseñada para facilitar la exploración, búsqueda, intercambio, filtrado y adición de becas. Los usuarios pueden descubrir fácilmente becas en función de diferentes atributos, como especialización académica, monto del premio, grado, escuela y estado. El equipo y yo estamos dedicados a mejorar continuamente la experiencia del usuario mediante la adición de nuevas funciones interesantes en un futuro próximo.",
        "moreDetails": "Mi responsabilidad principal es desarrollar e implementar la interfaz de usuario de la aplicación web, lo que incluye el diseño y la incorporación de diversas funcionalidades, como la validación de datos, el filtrado de becas y la traducción de idiomas. Además, he contribuido a la funcionalidad de back-end del sitio, lo que permite una interacción fluida entre los componentes y la base de datos, incluidas funciones como guardar y buscar becas e implementar reglas de seguridad de la base de datos. Para garantizar la calidad y la funcionalidad de los componentes, realizo pruebas unitarias utilizando Jest y React Testing Library. Además de programar, también participo activamente en la realización de revisiones de código para los miembros de mi equipo.",
        "mainAltText": "Una tableta y un iPhone que muestran la página de inicio del sitio web de becas.",
        "secondaryAltText": "Varias vistas del sitio web que muestran los filtros, la página de becas y el formulario de becas."
    },
    "nedflix": {
        "overview": "Una aplicación web para explorar, descubrir y listar películas y programas.",
        "description":  "Nedflix es una aplicación web integral que permite a los usuarios navegar y buscar fácilmente a través de una amplia colección de películas y programas. Con funciones como navegar y ver avances, los usuarios pueden encontrar rápidamente su próxima película o serie favorita. La plataforma también ofrece categorías populares como \"las más populares\" y \"mejor calificadas\" para ayudar a los usuarios a descubrir contenido nuevo que se alinee con sus intereses. Para realizar un seguimiento de sus favoritos, los usuarios pueden agregar o eliminar cómodamente películas y programas de su lista personalizada.",
        "moreDetails": "Para ofrecer la experiencia más actualizada y atractiva para los usuarios, el sitio obtiene su contenido de la API de The Movie Database. Para mejorar la experiencia del usuario y agilizar la navegación, se agregaron autenticación de usuario, carga diferida y desplazamiento infinito.",
        "mainAltText": "Una tableta y un iPhone que muestran una pancarta de una película seguida de carteles de películas para explorar.",
        "secondaryAltText": "Varias pantallas que muestran la página de mi lista, inicio de sesión, búsqueda y películas."
    },
    "casaMagda": {
        "overview": "Un sitio web que destaca los servicios de una pequeña empresa de limpieza.",
        "description":  "Casa Magda es un sitio web de una sola página que sirve como escaparate de los servicios de una pequeña empresa de limpieza. Además de destacar la gama de servicios de la empresa, el sitio también proporciona información valiosa sobre la historia, la misión y los valores de la empresa.",
        "moreDetails": "Construido con una combinación de HTML, CSS, JavaScript y JQuery, el sitio proporciona una experiencia de usuario muy atractiva e intuitiva. Mediante animaciones de CSS, técnicas de SEO y principios de UX, el sitio web pudo aumentar su visibilidad y sus ganancias en un 50%.",
        "mainAltText": "Un iPhone y un Macbook que muestran la página de destino del sitio web.",
        "secondaryAltText": "2 pantallas que muestran la página de inicio, sobre nosotros, nuestros servicios, ubicaciones y secciones del formulario de contacto del sitio web."
    },
    "trapd": {
        "overview": "Un juego de plataformas móvil de acción sin fin disponible en Google Play Store.",
        "description":  "TRAPD es un juego de plataformas de acción en el que el objetivo del juego es sobrevivir el mayor tiempo posible mientras esquivas una andanada de obstáculos, cañones y láseres. El juego ofrece un elenco de diversos personajes jugables para elegir, cada uno con su habilidad única. A lo largo del juego, descubrirás una variedad de monedas coleccionables, cada una con un valor diferente de puntos de experiencia (XP) que puedes usar para subir de nivel a tu personaje.",
        "moreDetails": "TRAPD es mi proyecto en solitario más ambicioso y se puede descargar gratis en Google Play Store. El juego cuenta con seguimiento de progreso automático y registro de puntaje alto. También se admiten transacciones en el juego, lo que permite a los jugadores usar las monedas que recolectan para mejorar las habilidades de su personaje y desbloquear nuevos personajes jugables. Como creador del juego, me enorgullece decir que he manejado todos los aspectos de su desarrollo, desde el diseño de la interfaz de usuario hasta la creación de animaciones, secuencias de comandos, recursos y sprites del juego, e incluso la composición de la música.",
        "mainAltText": "Un teléfono móvil que muestra el menú principal del juego TRAPD.",
        "secondaryAltText": "Múltiples teléfonos que muestran la tienda, las criaturas, las puntuaciones más altas, el fin del juego y las pantallas de juego."
    },
    "pacificMarineApp": {
        "overview": "Un juego interactivo destinado a educar a los visitantes del Centro de Mamíferos Marinos del Pacífico.",
        "description":  "Un juego creado para mostrar y educar a los usuarios sobre el trabajo de rehabilitación que realiza el Centro de Mamíferos Marinos del Pacífico. El juego cuenta la historia de cuatro leones marinos y permite a los usuarios recorrer el proceso de rehabilitación de cada animal.",
        "moreDetails": "Este fue mi proyecto final para UCI junto con otros 4 miembros del equipo. El juego se hizo con Unity y yo era el responsable de la programación, las animaciones y el diseño de niveles. Además de la programación, también era responsable de la interfaz de usuario, los recursos del juego y los efectos de sonido, además de supervisar el progreso de los demás miembros de mi equipo.",
        "mainAltText": "Una tablilla que muestra un león marino con un inventario de herramientas debajo.",
        "secondaryAltText": "Múltiples tablillas que muestran diferentes leones marinos tratados y rehabilitados con las herramientas del inventario."
    },
    "partyBash": {
        "overview": "Una aplicación complementaria para un juego de mesa que creé.",
        "description":  "Party bash consiste de jugadores que se mueven a lo largo de un tablero de juego, tratando de llegar primero a la línea de meta. Cada cuadro del tablero contiene un evento como ganar/perder monedas, comprar acciones, ganar premios, desafiar y robar monedas de otros.",
        "moreDetails": "La aplicación permite a los jugadores lanzar dados, cambiar de turno y realizar cálculos que de otro modo serían tediosos. Los cálculos incluyen la gestión de monedas, la obtención de premios aleatorios, desafiar a jugadores y ventajas de compra.",
        "mainAltText": "Un teléfono mostrando el menú del juego, con 2 jugadores listos para jugar.",
        "secondaryAltText": "Numerosos teléfonos que muestran las pantallas de monedas, tienda, rueda, desafío y tirada de dados."
    },
    "searchEd": {
        "overview": "Buscador de las páginas web de las Ciencias de la Información y Computación de UCI.",
        "description":  "Search-ED es un motor de búsqueda para navegar páginas web del departamento de Ciencias de la Información y Computación de UCI. El programa muestra los mejores resultados de una consulta dada.",
        "moreDetails": "El motor de búsqueda utiliza tokenización, frecuencia de términos, frecuencia de documentos inversa y etiquetas ponderadas para la calificación de páginas. La biblioteca BeautifulSoup se utilizó para analizar el corpus de todas las páginas web de ICS de UCI. Se usó Python para escribir el programa, MongoDB para la base de datos y TKinter para la GUI.",
        "mainAltText": "Una computadora portátil que muestra una pantalla dividida con 2 archivos de código Python abiertos.",
        "secondaryAltText": "2 monitores que muestran el campo de búsqueda seguido de los resultados y una base de datos MongoDB."
    },
    "faultLocalization": {
        "overview": "Un programa que encuentra qué líneas de código tienen más probabilidades de fallar las pruebas unitarias.",
        "description":  "Este programa implementa el enfoque de Tarántula para realizar la localización de fallas y ubicar qué líneas de código son más sospechosas de romper las pruebas unitarias de un proyecto de código abierto en Github.",
        "moreDetails": "Este programa contiene más de 4 mil archivos XML con análisis de cobertura de código. Para este algoritmo, observamos los casos de prueba que cubren cada línea del programa y comparamos la proporción de casos de prueba exitosos y fallidos. Cuanto mayor sea la proporción de casos de pruebas fallidas en comparación con las exitosas, mayor será la sospecha de esa línea. La sospecha es un número entre 0 y 1, donde un número más alto significa una probabilidad más alta de que la línea haya provocado que una prueba falle.",
        "mainAltText": "Una computadora portátil que muestra una pantalla dividida con 2 archivos de código Python abiertos.",
        "secondaryAltText": "Un monitor con una pantalla dividida de un archivo CSV con puntajes y un archivo de código abierto al lado."
    },
    "operatingSystemGui": {
        "overview": "Un sistema operativo simple que simula a los usuarios escribiendo en discos e imprimiendo archivos.",
        "description":  "Este programa imita un sistema operativo simple al administrar las solicitudes de lectura, escritura e impresión de los usuarios. Se utiliza una GUI para mostrar las solicitudes de los usuarios, los estados de los discos e impresoras y el contenido del administrador de directorios.",
        "moreDetails": "El programa admite una cantidad dinámica de usuarios, impresoras y discos y utiliza paralelismo e hilos para ejecutar comandos desde archivos de usuario. Cuando se ejecuta el comando guardar, se solicita un recurso de disco y el contenido del archivo se escribe en el disco hasta que se encuentra el comando final. El comando final también almacena el número de disco, el sector de inicio y la longitud del archivo. A continuación, se crea una nueva entrada en el directorio y se libera el recurso de disco. Por último, el comando de impresión busca el nombre del archivo en el administrador de directorios, obtiene una impresora libre e imprime los datos en un archivo externo.",
        "mainAltText": "Una computadora portátil que muestra una pantalla dividida con 2 archivos de código Java abiertos.",
        "secondaryAltText": "Un monitor con un archivo python abierto y una GUI al lado que muestra los usuarios, discos, impresoras y el estado del administrador de directorios."
    },
    "infoWeather": {
        "overview": "Un sitio web para buscar y ver información meteorológica desde varios lugares.",
        "description":  "Info Weather es un sitio web simple que muestra el clima actual y el pronóstico de cualquier ubicación determinada.",
        "moreDetails": "Info Weather está escrito con React y obtiene la información de la API de OpenWeather y muestra la información de forma minimalista. Además, el sitio determina los íconos apropiados según el clima.",
        "mainAltText": "Un teléfono y una tableta que muestran información meteorológica.",
        "secondaryAltText": "Una pantalla de sitio web de información meteorológica."
    }
}