{
     "head":  {
        "title": "Edwin Lopez | Projects",
        "description": "A showcase of Edwin's various webs/mobile projects and computer science programs.",
        "keywords": "projects, mobile development, web development, frameworks, software engineer, front end, back end"
    },
    "projects": "My Coding Journey",
    "checkOutProjects": "Step inside my creative world and explore my diverse range of projects, crafted using various programming languages and frameworks.",
    "behindLaptopImgAlt": "Memoji of myself behind a laptop.",
    "dreamScholars": {
        "overview": "A web application that facilitates the discoverability of scholarships for students.",
        "description": "DreamScholars is a web application designed to facilitate scholarship exploration, search, sharing, filtering, and addition. Users can easily discover scholarships based on different attributes such as academic major, award amount, grade, school, and state. The team and I are dedicated to continuously improving and enhancing the user experience by adding exciting new features in the near future.",
        "moreDetails": "My primary responsibility is to develop and implement the user interface of the web application, which includes designing and incorporating various functionalities such as data validation, scholarship filtering, and language translation. Additionally, I have contributed to the backend functionality of the site, enabling seamless interaction between components and the database, including features like saving and fetching scholarships and implementing database security rules. To ensure the quality and functionality of the components, I conduct unit tests using Jest and React Testing Library. Besides coding, I also actively engage in conducting code reviews for my team members.",
        "mainAltText": "A tablet and iPhone showcasing the home page of the scholarship website.",
        "secondaryAltText": "Various views of the website displaying the filters, scholarship page, and scholarship form."
    },
    "nedflix": {
        "overview": "A web application for exploring, discovering and listing movies and shows.",
        "description":  "Nedflix is a comprehensive web application that enables users to easily navigate and search through a vast collection of movies and shows. With features like browsing and watching trailers, users can quickly find their next favorite film or series. The platform also offers popular categories such as \"most trending\" and \"top-rated\" to help users discover new content that aligns with their interests. To keep track of their favorites, users can conveniently add or remove movies and shows to their personalized list.",
        "moreDetails": "To deliver the most up-to-date and engaging experience for users, the site sources its content from The Movie Database API. To enhance the user experience and streamline navigation, user authentication, lazy loading, and infinite scrolling was added.",
        "mainAltText": "A tablet and iPhone displaying a movie banner followed by movie posters to explore.",
        "secondaryAltText": "Various screens displaying the my list, sign-in, search and movie page."
    },
    "casaMagda": {
        "overview": "A website highlighting the services of a small housekeeping company.",
        "description":  "Casa Magda is a one-page website that serves as a showcase for a small cleaning company's services. In addition to highlighting the company's range of services, the site also provides valuable information about the company's history, mission, and values.",
        "moreDetails": "Built using a combination of HTML, CSS, JavaScript, and JQuery, the site provides a highly engaging and intuitive user experience. By utilizing CSS animations, SEO techniques, and UX principles, the website was able to increase its visibility and profits by 50%. ",
        "mainAltText": "An iPhone and Macbook displaying the landing page of the website.",
        "secondaryAltText": "2 screens showing the landing page, about us, our services, locations and contact form sections of the website."
    },
    "trapd": {
        "overview": "An endless action mobile platformer game available on the Google Play store.",
        "description":  "TRAPD is an action platformer where the goal of the game is to survive as long as possible while dodging a barrage of obstacles, cannons and lasers. The game offers a cast of diverse playable characters to choose from, each with their unique set of abilities. Through out the game, you'll discover an array of collectible coins, each worth different amounts of experience points (XP) that you can use to level up your character.",
        "moreDetails": "TRAPD is my most ambitious solo project and it's free to download on the Google play store. The game features automatic progress tracking and high score recording. In-game transactions are also supported, allowing players to use the coins they collect to upgrade their character's abilities and unlock new playable characters. As the creator of the game, I'm proud to say that I've handled every aspect of its development, from designing the user interface to creating the animations, scripting, game assets and sprites, and even composing the music.",
        "mainAltText": "A mobile phone showcasing the main menu of the TRAPD game.",
        "secondaryAltText": "Multiple phones displaying the shop, creatures, highscores, game over and gameplay screens."
    },
    "pacificMarineApp": {
        "overview": "An interactive game aimed at educating vistors of the Pacific Marine Mammal Center.",
        "description":  "An interactive game designed to showcase and educate users about the rehabilitation work carried out by the Pacific Marine Mammal Center. The game takes users on a journey through the rehabilitation process of four sea lions, offering a comprehensive insight into the efforts of the center in nursing marine mammals back to health. ",
        "moreDetails": "As part of my capstone project at UCI, I collaborated with four other team members to create this innovative game using Unity. My primary contributions included designing and implementing scripts, animations, and level designs, while also ensuring that the user interface, game assets, and sound effects were up to standard. Beyond programming, I also took on a leadership role, overseeing the work of my team members and ensuring that the project was on track. By working together, we were able to create an immersive and educational experience that showcases the crucial work of the Pacific Marine Mammal Center in rehabilitating marine mammals",
        "mainAltText": "A tablet showing a sea lion with an inventory of tools below it.",
        "secondaryAltText": "Multiple tablets showing different sea lions being treated and rehabilited by the tools in the inventory."
    },
    "partyBash": {
        "overview": "A companion application to a board game I created.",
        "description":  "The objective of Party Bash is for players to compete against each other, by moving along a game board and aiming to reach the finish line before their opponents do. The game board is designed with a variety of squares that introduce exciting events and challenges to the game. Each square contains a unique event, which may result in winning or losing coins, purchasing additional actions, receiving prizes, or even stealing coins from other players.",
        "moreDetails": "The app provides players with a seamless gaming experience, by automating various aspects of gameplay that would otherwise be tedious and time-consuming. For example, the app allows players to roll virtual dice with ease. Additionally, the app simplifies calculations related to coin management, such as keeping track of coins won or lost during gameplay. Players can also use the app to manage random prize winnings, challenges, and purchases of perks or upgrades.",
        "mainAltText": "A phone displaying the menu of the game, with 2 players ready to play.",
        "secondaryAltText": "Numerous phones showcasing the coins, shop, wheel, challenge and dice roll screens"
    },
    "searchEd": {
        "overview": "A search engine of the web pages for the Information & Computer Sciences from UCI.",
        "description":  "Search-ED is a search engine specifically designed to assist users in exploring the vast array of web pages associated with the Informations & Computer Sciences department at the University of California, Irvine. By entering a search query, Search-ED retrieves the most relevant web pages and displays them in an organized and easily navigable format.",
        "moreDetails": "In order to provide users with the most relevant search results, Search-ED employs techniques such as tokenization, term frequency analysis, inverse document frequency weighting, and weighted tags for page scoring. The BeautifulSoup library was utilized to parse the corpus of the entire ICS web pages from the University of California, Irvine. Python was chosen as the programming language for the development of the search engine, while MongoDB was utilized as the database management system. Additionally, the graphical user interface (GUI) of Search-ED was created using the TKinter library. ",
        "mainAltText": "A laptop displaying a split screen with 2 Python code files open.",
        "secondaryAltText": "2 monitors displaying the search field followed by the results and a MongoDB database."
    },
    "faultLocalization": {
        "overview": "A program that finds which lines of code are most likely to break unit tests.",
        "description":  "The fault localization capabilities of the program are achieved through the implementation of the Tarantula approach, which is a sophisticated technique for identifying which lines of code are most likely to be responsible for breaking the unit-tests of an open-source project hosted on Github. By utilizing this approach, the program is able to effectively isolate the sections of code that are most suspect.",
        "moreDetails": "This program contains a vast repository of over 4 thousand XML files containing detailed code coverage analysis. The algorithm used by the program relies on a careful analysis of the test cases that cover each line in the program, comparing the ratio of successful and failing test cases to determine the level of suspiciousness for each line of code. In essence, the algorithm assigns a value between 0 and 1 to each line of code, with a higher value indicating a greater likelihood that the line is responsible for causing a test to fail. ",
        "mainAltText": "A laptop displaying a split screen with 2 Python code files open.",
        "secondaryAltText": "A monitor with a split screen of a CSV file with scores and a code file open next to it."
    },
    "operatingSystemGui": {
        "overview": "A simple operating system that simulates users writing to disks and printing files.",
        "description":  "Designed to simulate a basic operating system, this program manages requests for reading, writing, and printing. A graphical user interface (GUI) is utilized to display the requests of users, as well as the status of disks and printers and the contents of the directory manager. ",
        "moreDetails": "The program supports a dynamic number of users, printers and disks and uses parallelism and threads to execute commands from user files. When the save command is executed, the program requests a disk resource and writes the file contents to the disk until the end command is encountered. The end command records the disk number, starting sector, and file length, creating a new entry in the directory manager and releasing the disk resource. Finally, the print command searches the directory manager for the specified file name, selects a free printer, and prints the data to an external file.",
        "mainAltText": "A laptop displaying a split screen with 2 Java code files open.",
        "secondaryAltText": "A monitor with a python file open and a GUI next to it showcasing the users, disks, printers and directory manager status."
    },
    "infoWeather": {
        "overview": "A website to search and view weather information from various locations.",
        "description":  "Info Weather is a simple website that displays the current weather and forecast of any given location.",
        "moreDetails": "Info Weather is written with React and fetches the information from the OpenWeather API and displays the information in a minimalistic way. In addition, the site determines the appropriate icons based on the weather.",
        "mainAltText": "A phone and tablet displaying weather information.",
        "secondaryAltText": "A website screen of weather information."
    }
}
